
const ls = {
    1: [
        '神秘少年：......', 
        '我：......', 
        '神秘少年：......', 
        '我：这是你的书么？',
        '神秘少年：是，此乃吾之书也',
        '我：对不起，我刚捡到的，还给你。',
        '神秘少年：感谢。',
        '我：你很喜欢看书吗？',
        '神秘少年：非也，打发时间而已。',
        '我：......',
        '神秘少年：这时代变化太大，吾偶尔也是需要学习。',
        '我：你这本书讲的是什么呀？',
        '神秘少年：此乃大荒，远古洪荒，龙煌和犼集天地灵气而生，与创世神人一同创造大荒世界。',
        '我：原来如此，那龙煌和犼呢？',
        '神秘少年：大荒建成后，神人追随煌犼，煌犼亦回护神人，后凶兽之潮爆发，煌与犼在对待凶兽的态度上产生了无法妥协的矛盾，遂大战千年，史称“镜花之劫”。',
        '我：怎么会这样，那他们现在还好吗？',
        '神秘少年：元气大伤的煌犼在虚渊中休养，创世神人重塑大荒并创造人类，等到煌犼苏醒之时，已是大荒再次欣欣向荣的时代。',
        '我：难怪大荒是一个景色那么美丽的地方！',
        '神秘少年：然龙生九子、犼造四凶，双方因人类去留问题再次对立，爆发“终焉之战”。',
        '我：这么美丽的地方怎么会有战争呢...',
        '神秘少年：战后煌灵气消散飘荡于天地之间，而犼陷入沉睡。四凶返回深渊，沉睡休养。九子重伤后也沉睡休养。',
        '我：原来是这样啊。真的希望这个世界能没有战争，希望大家能平平安安。',
        '我：谢谢你告诉我这么多故事，我能知道你的名字吗？',
        '白泽：吾乃白泽，是被封印了两千年的龙煌辅佐官。',
        '我：哇！原来你看的是两千年前的故事啊！',
        '白泽：......',
        '我：那你能在路上和我说说别的大荒故事吗？',
        '白泽：可。',
        '我：我能把我的镜花录账号给你吗？希望以后还能听到你的故事！',
        '白泽：然。'
    ],
    2: [
        '我：这是什么呀？好可爱！',
        '神秘男子：......',
        '我：对不起打扰您了。请问这个是您的东西吗？',
        '神秘男子：此乃肉螈。',
        '我：哎？',
        '神秘男子：水做的。',
        '我：这个小东西真可爱，还给您，不知该如何称呼您呢？',
        '神秘男子：共工，善于控水。',
        '我：您是水神大人呀！',
        '我：没想到水神大人看上去那么严肃，竟然会做出这样水做的小动物~还是挺可爱的~',
        '共工：......',
        '共工：你喜欢，送你便是。',
        '我：共工大人能控制泗水中的水吗，太厉害了！',
        '共工：吾居于九州泗水畔，泗水曾过于活泼，常有踰距之行。吾治之。',
        '我：原来是共工大人治理好了泗水啊！',
        '共工：后有九人，在泗水畔结庐而居。',
        '我：一定是因为共工大人治理好了泗水，才能让他们在这边安居对吧。',
        '共工：是。九州，已追随我千年，以吾之力，保九州安宁。',
        '我：九州诞生有千年啦，多亏共工大人治理好了泗水，那现在九州一定很热闹吧！',
        '共工：常有九州庆典，十分热闹。',
        '我：那九州庆典里是不是经常会有很多很多好吃的东西呀？',
        '共工：肉螈料理，应有尽有。',
        '我：哎？！',
        '我：原来这个肉螈是可以做食物的吗！',
        '共工：你若喜欢，可留你的镜花录账号，以后若再有庆典，带你一同去看看便是。'
    ],
    3: [
        '神秘少女：这卷画的是......日月山吧......',
        '我：日月山在哪里呀？',
        '神秘少女：大荒之中，有山名曰日月山，天枢也。吴姖天门，日月所入。',
        '我：大荒还有这样的地方呀？',
        '神秘少女：这让我想到了姐姐羲和......',
        '我：羲和是您的姐姐，那您不会是......',
        '神秘少女：吾乃常羲，与羲和同源而生的姐妹。',
        '常羲：不过，我们离开日月山已数千年，与姐姐羲和，也已经许久未见了。',
        '我：为什么要分开呢，感觉您很想她。',
        '常羲：因为我们之前有些争执，她再也不与相见。我和姐姐注定渐行渐远。',
        '我：她不愿意见您，您可以去找她呀。',
        '常羲：我曾每月将书信一封封寄去，但姐姐一封也不曾回过。',
        '常羲：......不提也罢，只希望姐姐现在能不再恨我。',
        '我：她是您的亲姐姐，不会怨恨你的，你们可是亲姐妹呢。',
        '常羲：即使我们渐行渐远，但我仍默默地守望着姐姐，只希望她能幸福。',
        '我：您姐姐有你的守护一定会幸福的！',
        '我：那您呢？您的幸福呢？',
        '常羲：我？月光，不负韶华之美。你听我说了那么多事，也是我的幸福呢。',
        '常羲：若有人能与我一同欣赏月色美景便足矣。',
        '我：您不嫌弃，就让我来陪您一起欣赏吧~',
        '常羲：愿得你镜花录账号，下次就让我编织出美丽的月华，邀你一同欣赏吧~'
    ],
    4: [
        '我：这怎么还有人在车上喝酒......真是奇怪......',
        '神秘少女：拿开你的手！要不然......宰了你！',
        '我：啊！',
        '神秘少女：(饮酒)啊......就是这种感觉......太美妙了......哼哼哼哈哈哈哈~',
        '神秘少女：这可是驳用过的酒坛。只有雍和我才能触碰。',
        '我：你叫雍和呀，你为什么要喝酒呢，是不是不开心呀？',
        '雍和：你这种厚颜无耻的猎物，竟然能说出驳一样的话......',
        '我：不开心的话，这一路，我陪你喝吧~',
        '雍和：哼哼哼，也行，来一起喝，这世上，唯有酒能解愁。',
        '我：你把酒倒给我吧，这酒坛是你如此珍爱的物件，我还是别碰的好......',
        '雍和：哼，知道你乖了，下次不杀你~',
        '我：所以你为什么不开心呀......可以说给我听听嘛？',
        '雍和：哼哼哼......',
        '我：（这人该不会已经喝醉了吧......）',
        '雍和：喝了酒，就什么也不记得了。喝了酒，身上就是暖的了。',
        '我：别哭丧着脸，都不漂亮了。',
        '雍和：你不可能回来了......',
        '我：别难过啦，以后如果你再不开心可以找我，我陪你喝~',
        '雍和：你认真的吗嘛？我可能会给你带来灾祸哦？',
        '我：当然是认真的啦，一言既出驷马难追！',
        '雍和：哎呀，哈哈哈~哈哈哈哈~',
        '雍和：把你的镜花录账号拿来，下次有酒，再约！'
    ]
}

export function getLine(role = 1, step = 0) {
    return ls[role] && ls[role][step]
}

export function getAll(role=1) {
    return ls[role]
}

export default {
    getLine,
    getAll
}